"""Снабди каждый комментарий правильной командой."""

python -V  # команда для проверки текущей версии Питона
python # запуск интерпретатора Питона в режиме REPL
python -m venv environment_name # создание виртуального окружения в текущей директории
source environment_name/bin/activate # активация вышесозданного виртуального окружения
deactivate # деактивация виртуального окружения
python run.py # запуск скрипта run.py находящегося в текущей директории
python -m pip install package_name # установка пакета requests через пакетный менеджер pip
