"""Задания по ветвлениям, итерациям и вводу данных."""

# напиши функцию, которая принимает на вход любое
# количество чисел и сообщает, есть ли среди них чётное
def even_numbers(*argv) -> None:
    is_there_even = False
    for arg in argv:
        if arg % 2 == 0: 
            is_there_even = True
            break
    print({True: 'Четные есть', False: 'Четных нет'}[is_there_even])

# используй тернарный оператор, чтобы вызвать функцию
# если возраст больше 21 года, в противном случае верни
# сообщение "Мы не продаём алкоголь несовершеннолетним."
age = 17
#sell_alcohol()

def sell_alcohol(age) -> bool:
    if age >= 21: 
        print("Можно продать алкоголь.")
    else: 
        print("Мы не продаём алкоголь несовершеннолетним.")
        return False

# напиши функцию, которая проверит, является ли строка ключевым словом в Питоне
# тебе понадобится модуль keyword, импортируй его и изучи с помощью dir()
import keyword

def check_dir(string):
    if string in dir(keyword): 
        print(f'Строка {string} находится в списке dir(keyword)')
    else: 
        print('Строка не находится в списке dir(keyword)')

# напиши функцию, которая возвращает тип данных на русском языке:
# число, строка, булевый, None, список, кортеж, множество, словарь
# пример: get_type("что-то") возвращает "Это строка."
# пример2: get_type(42) возвращает "Это словарь."
def get_type(object: str):
    try:
        print('Это', {
            int: 'число',
            dict: 'словарь',
            float: 'число с плавающей точкой',
            bool: 'булевое значение',
            set: 'множество',
            str: 'строка',
            list: 'список',
            0: 'пустое значение',
            tuple: 'неизменяемый список'
        }[type(object)])
    except:
        print('Это пустое значение')